<template>
    <div class="bloggers">
        <div class="title">
            <svg t="1743605160996" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="12502" width="20" height="20"><path d="M911.1 226.9H715.6v97.7h146.6v154.8c0 53.8-44 97.7-97.7 97.7-17.9 0-34.4-5.2-48.9-13.7v104.4c15.7 4.1 31.9 7 48.9 7 107.5 0 195.5-88 195.5-195.5V275.8c0-26.9-22-48.9-48.9-48.9zM112.9 226.9h195.5v97.7H161.7v154.8c0 53.8 44 97.7 97.7 97.7 17.9 0 34.4-5.2 48.9-13.7v104.4c-15.7 4.1-31.9 7-48.9 7C152 674.9 64 586.9 64 479.4V275.8c0-26.9 22-48.9 48.9-48.9zM715.6 960H308.4c-22.4 0-40.7-18.3-40.7-40.7 0-22.4 18.3-40.7 40.7-40.7h407.3c22.4 0 40.7 18.3 40.7 40.7 0 22.4-18.4 40.7-40.8 40.7zM524.6 341.9l26.8 54.4c2.1 4.2 6 7 10.6 7.7l60 8.7c11.6 1.7 16.2 15.9 7.8 24L586.4 479c-3.3 3.2-4.8 7.9-4.1 12.5l10.3 59.8c2 11.5-10.1 20.3-20.4 14.8l-53.7-28.2c-4.1-2.2-9-2.2-13.1 0l-53.7 28.2c-10.3 5.4-22.4-3.3-20.4-14.8l10.3-59.8c0.8-4.6-0.7-9.2-4.1-12.5l-43.4-42.3c-8.4-8.1-3.7-22.3 7.8-24l60-8.7c4.6-0.7 8.6-3.5 10.6-7.7l26.8-54.4c5.2-10.5 20.2-10.5 25.3 0z" fill="#0420c8" p-id="12503"></path><path d="M674.9 145.5h-61.1c22.4 0 40.7 18.3 40.7 40.7v366.5c0 101.5-75.6 185.6-173.1 200.5 10 1.5 20.1 3.1 30.5 3.1 112 0 203.6-91.6 203.6-203.6V186.2c0.1-22.4-18.2-40.7-40.6-40.7z" fill="#0420c8" p-id="12504"></path><path d="M715.6 64H308.4c-44.8 0-81.5 36.7-81.5 81.5v407.3c0 156.8 128.3 285.1 285.1 285.1s285.1-128.3 285.1-285.1V145.5c0-44.8-36.7-81.5-81.5-81.5z m0 488.7c0 112-91.6 203.6-203.6 203.6s-203.6-91.6-203.6-203.6V186.2c0-22.4 18.3-40.7 40.7-40.7h325.8c22.4 0 40.7 18.3 40.7 40.7v366.5z" fill="#0420c8" p-id="12505"></path></svg>
            <span>博主推荐</span>
        </div>
    </div>
</template>

<script setup lang="ts">
</script>

<style scoped lang="scss">
.bloggers {
    width: 100%;
    height: 400px;
    padding: 10px;
    // border: 1px solid blue;

    .title {
        display: flex;
        justify-content: center;
        align-items: center;
        // border: 1px solid green;

        span {
            font-family: 'Oswald', sans-serif;
            font-size: 18px;
            font-weight: bold;
            background: linear-gradient(90deg, #6A11CB, #2575FC);
            background-clip: text;
            -webkit-text-fill-color: transparent;
            margin-left: 4px;
            position: relative;
            display: inline-block;
        }
    }
}
</style>